<?
// ===================================================================
// Sim Roulette -> Settings
// License: GPL v3 (http://www.gnu.org/licenses/gpl.html)
// Copyright (c) 2016-2020 Xzero Systems, http://sim-roulette.com
// Author: Nikita Zabelin
// ===================================================================

// --- MySQL ---
$host="localhost";
$username="";
$userpass="";
$dbname="";

// -- Global ---
$GLOBALS['sets'] = '
---;Авторизация
admin_login;Логин администратора;32;Примечание: если авторизация не требуется — заполнять не нужно
admin_pass;Пароль администратора;32
---;Интерфейс
main_menu;Меню;txt;Примечание: для подменю добавьте "submenu" после точки с запятой в конце строки
page_limit;Количество позиций на странице;4
---;Параметры
term_int;Интервал обновления окна ответов терминала в миллисекундах;4;
phone_prefix;Префикс телефонного номера;3;Без +
email;E-mail;32;Адрес электронной почты для перенаправления SMS полученных в Online-режиме
---;Лог
log_size;Лимит размера лог-файлов в KB;6;Примечание: 0 — не вести лог / -1 — не обрезать
';
?>